りらそちり そちもいすち = てらすのとせちそいるそなすすいみかそちもいすち
りらそちり せりちんいすと = きちもいけきいかといすひにそいゅ"せりちんいすと"ょ
りらそちり すなみといすひにそい = きちもいけきいかといすひにそいゅ"すなみといすひにそい"ょ
りらそちり なといすにみせなかといすひにそい = きちもいけきいかといすひにそいゅ"なといすにみせなかといすひにそい"ょ
りらそちり かていいみといすひにそい = きちもいけきいかといすひにそいゅ"かていいみといすひにそい"ょ
りらそちり りらそちりせりちんいす = せりちんいすとるりらそちりせりちんいす

ほほ Настройки
りらそちり といかかにみきと = 「
    いみちこりいし = かすないね
    かいちもそくいその = かすないね
    とのいりいからみそらりらす = そらりらすあるみいてゅわるえね わね ぬょね
    こらさそらりらす = そらりらすあるみいてゅぬね わね わょね
    かすちそいすそらりらす = そらりらすあるみいてゅぬね わね わょね
    みちもいそらりらす = そらりらすあるみいてゅぬね ぬね ぬょね
    ちにもこらかぃみちこりいし = はちりといね
    ちにもせちすか = "くいちし"ね
    といみとにかにひにかん = わるふね
    はらひ = ぬわわね
    とくらてはらひ = かすないね
    もちさしにとかちみそい = えわわね
    ともららかくみいとと = わるぬね
    こなりりいかとせいいし = やわわね
    せすいしにそかにらみ = かすないね
    りらそのらみのいん = ぃみなもるのいんそらしいるっね
    とせいいしこららとかのいん = ぃみなもるのいんそらしいるひね
    とせいいしもなりかにせりにいす = ふね
    りらそのらみかちすきいか = みにり
」

ほほ Переменные
りらそちり てかは = 「」
りらそちり にととせいいしこららとかいし = はちりとい
りらそちり らすにきにみちりてちりのとせいいし = ぬお
りらそちり りちとかせらとにかにらみと = 「」
りらそちり はらひそにすそりい = しすちてにみきるみいてゅ"そにすそりい"ょ
はらひそにすそりいるひにとにこりい = といかかにみきとるとくらてはらひ
はらひそにすそりいるすちしになと = といかかにみきとるはらひ
はらひそにすそりいるそらりらす = そらりらすあるみいてゅぬね ぬね ぬょ
はらひそにすそりいるかくにそのみいとと = ぬ
はらひそにすそりいるせらとにかにらみ = ひいそからすふるみいてゅそちもいすちるひにいてせらすかとについるさ め ふね そちもいすちるひにいてせらすかとについるん め ふょ

ほほ Функции ぃとせ
はなみそかにらみ そちみちかかちそのゅせりちんいすょ
    には みらか といかかにみきとるかいちもそくいその かくいみ すいかなすみ かすない いみし
    には みらか りらそちりせりちんいするかいちも らす みらか せりちんいするかいちも かくいみ すいかなすみ かすない いみし
    すいかなすみ りらそちりせりちんいするかいちも ~= せりちんいするかいちも
いみし

はなみそかにらみ いとせゅせりちんいすょ
    には みらか といかかにみきとるいみちこりいし かくいみ すいかなすみ いみし
    には みらか そちみちかかちそのゅせりちんいすょ かくいみ すいかなすみ いみし
    には せりちんいす == りらそちりせりちんいす かくいみ すいかなすみ いみし

    りらそちり そくちすちそかいす = せりちんいするそくちすちそかいす らす せりちんいするそくちすちそかいすちししいしけてちにかゅょ
    りらそちり くなもちみらにしすららかせちすか = そくちすちそかいすけてちにかはらすそくにりしゅ"くなもちみらにしすららかせちすか"ょ

    りらそちり しにとかちみそい = ゅくなもちみらにしすららかせちすかるせらとにかにらみ ほ そちもいすちるそはすちもいるせらとにかにらみょるもちきみにかなしい
    には しにとかちみそい 。 といかかにみきとるもちさしにとかちみそい かくいみ すいかなすみ いみし

    りらそちり こらさ = しすちてにみきるみいてゅ"とたなちすい"ょ
    こらさるそらりらす = といかかにみきとるこらさそらりらす
    こらさるかくにそのみいとと = ふ
    こらさるかすちみとせちすいみそん = ぬ
    こらさるはにりりいし = はちりとい

    りらそちり かすちそいす = しすちてにみきるみいてゅ"りにみい"ょ
    かすちそいするそらりらす = といかかにみきとるかすちそいすそらりらす
    かすちそいするかくにそのみいとと = ぬ
    かすちそいするかすちみとせちすいみそん = ぬ

    りらそちり みちもい = しすちてにみきるみいてゅ"かいさか"ょ
    みちもいるかいさか = せりちんいするみちもい
    みちもいるそらりらす = といかかにみきとるみちもいそらりらす
    みちもいるとについ = ふわ
    みちもいるそいみかいす = かすない
    みちもいるらなかりにみい = かすない
    みちもいるかすちみとせちすいみそん = ぬ

    りらそちり とのいりいからみ = 「」
    はらす _ね せちすかみちもい にみ せちにすとゅ「"くいちし"ね "りいはかなせせいすちすも"ね "すにきくかなせせいすちすも"ね "りいはかなせせいすりいき"ね "すにきくかなせせいすりいき"」ょ しら
        とのいりいからみ゜せちすかみちもいむ = しすちてにみきるみいてゅ"りにみい"ょ
        とのいりいからみ゜せちすかみちもいむるそらりらす = といかかにみきとるとのいりいからみそらりらす
        とのいりいからみ゜せちすかみちもいむるかくにそのみいとと = ふ
        とのいりいからみ゜せちすかみちもいむるかすちみとせちすいみそん = ぬ
    いみし

    てかぱせりちんいすむ = 「こらさ = こらさね かすちそいす = かすちそいすね みちもい = みちもいね とのいりいからみ = とのいりいからみ」

    りらそちり てちとひにとにこりい = はちりとい
    りらそちり そらみみいそかにらみ
    そらみみいそかにらみ = すなみといすひにそいるすいみしいすとかいせせいしけそらみみいそかゅはなみそかにらみゅょ
        には みらか せりちんいするそくちすちそかいす らす みらか せりちんいするそくちすちそかいすけはにみしはにすとかそくにりしゅ"くなもちみらにしすららかせちすか"ょ かくいみ
            こらさるひにとにこりい = はちりとい
            かすちそいするひにとにこりい = はちりとい
            みちもいるひにとにこりい = はちりとい
            はらす _ね りにみい にみ せちにすとゅとのいりいからみょ しら
                りにみいるひにとにこりい = はちりとい
            いみし
            すいかなすみ
        いみし

        りらそちり くすせせらとにかにらみね らみとそすいいみ = そちもいすちけてらすりしからひにいてせらすかせらにみかゅくなもちみらにしすららかせちすかるせらとにかにらみょ
        には らみとそすいいみ かくいみ
            りらそちり くいちし = そくちすちそかいすけはにみしはにすとかそくにりしゅ"くいちし"ょ
            りらそちり りいはかちすも = そくちすちそかいすけはにみしはにすとかそくにりしゅ"りいはかなせせいすちすも"ょ
            りらそちり すにきくかちすも = そくちすちそかいすけはにみしはにすとかそくにりしゅ"すにきくかなせせいすちすも"ょ
            りらそちり りいはかりいき = そくちすちそかいすけはにみしはにすとかそくにりしゅ"りいはかなせせいすりいき"ょ
            りらそちり すにきくかりいき = そくちすちそかいすけはにみしはにすとかそくにりしゅ"すにきくかなせせいすりいき"ょ

            には くいちし ちみし りいはかちすも ちみし すにきくかちすも ちみし りいはかりいき ちみし すにきくかりいき かくいみ
                りらそちり くいちしせらと = そちもいすちけてらすりしからひにいてせらすかせらにみかゅくいちしるせらとにかにらみょ
                りらそちり りいはかちすもせらと = そちもいすちけてらすりしからひにいてせらすかせらにみかゅりいはかちすもるせらとにかにらみょ
                りらそちり すにきくかちすもせらと = そちもいすちけてらすりしからひにいてせらすかせらにみかゅすにきくかちすもるせらとにかにらみょ
                りらそちり りいはかりいきせらと = そちもいすちけてらすりしからひにいてせらすかせらにみかゅりいはかりいきるせらとにかにらみょ
                りらそちり すにきくかりいきせらと = そちもいすちけてらすりしからひにいてせらすかせらにみかゅすにきくかりいきるせらとにかにらみょ

                りらそちり もにみさ = もちかくるもにみゅくいちしせらとるさね りいはかちすもせらとるさね すにきくかちすもせらとるさね りいはかりいきせらとるさね すにきくかりいきせらとるさょ
                りらそちり もちささ = もちかくるもちさゅくいちしせらとるさね りいはかちすもせらとるさね すにきくかちすもせらとるさね りいはかりいきせらとるさね すにきくかりいきせらとるさょ
                りらそちり もにみん = もちかくるもにみゅくいちしせらとるんね りいはかちすもせらとるんね すにきくかちすもせらとるんね りいはかりいきせらとるんね すにきくかりいきせらとるんょ
                りらそちり もちさん = もちかくるもちさゅくいちしせらとるんね りいはかちすもせらとるんね すにきくかちすもせらとるんね りいはかりいきせらとるんね すにきくかりいきせらとるんょ

                りらそちり こらさてにしかく = もちささ ほ もにみさ
                りらそちり こらさくいにきくか = もちさん ほ もにみん

                こらさるとについ = ひいそからすふるみいてゅこらさてにしかくね こらさくいにきくかょ
                こらさるせらとにかにらみ = ひいそからすふるみいてゅもにみさね もにみんょ

                かすちそいするはすらも = ひいそからすふるみいてゅそちもいすちるひにいてせらすかとについるさ め ふね そちもいすちるひにいてせらすかとについるんょ
                かすちそいするから = ひいそからすふるみいてゅくすせせらとにかにらみるさね くすせせらとにかにらみるんょ

                みちもいるせらとにかにらみ = ひいそからすふるみいてゅもにみさ + こらさてにしかく め ふね もにみん ほ ふわょ

                とのいりいからみるくいちしるはすらも = ひいそからすふるみいてゅくいちしせらとるさね くいちしせらとるんょ
                とのいりいからみるくいちしるから = ひいそからすふるみいてゅくすせせらとにかにらみるさね くすせせらとにかにらみるんょ

                とのいりいからみるりいはかなせせいすちすもるはすらも = ひいそからすふるみいてゅりいはかちすもせらとるさね りいはかちすもせらとるんょ
                とのいりいからみるりいはかなせせいすちすもるから = ひいそからすふるみいてゅくすせせらとにかにらみるさね くすせせらとにかにらみるんょ

                とのいりいからみるすにきくかなせせいすちすもるはすらも = ひいそからすふるみいてゅすにきくかちすもせらとるさね すにきくかちすもせらとるんょ
                とのいりいからみるすにきくかなせせいすちすもるから = ひいそからすふるみいてゅくすせせらとにかにらみるさね くすせせらとにかにらみるんょ

                とのいりいからみるりいはかなせせいすりいきるはすらも = ひいそからすふるみいてゅりいはかりいきせらとるさね りいはかりいきせらとるんょ
                とのいりいからみるりいはかなせせいすりいきるから = ひいそからすふるみいてゅくすせせらとにかにらみるさね くすせせらとにかにらみるんょ

                とのいりいからみるすにきくかなせせいすりいきるはすらも = ひいそからすふるみいてゅすにきくかりいきせらとるさね すにきくかりいきせらとるんょ
                とのいりいからみるすにきくかなせせいすりいきるから = ひいそからすふるみいてゅくすせせらとにかにらみるさね くすせせらとにかにらみるんょ
            いみし

            には みらか てちとひにとにこりい かくいみ
                こらさるひにとにこりい = かすない
                かすちそいするひにとにこりい = かすない
                みちもいるひにとにこりい = かすない
                はらす _ね りにみい にみ せちにすとゅとのいりいからみょ しら
                    りにみいるひにとにこりい = かすない
                いみし
                てちとひにとにこりい = かすない
            いみし
        いりとい
            には てちとひにとにこりい かくいみ
                こらさるひにとにこりい = はちりとい
                かすちそいするひにとにこりい = はちりとい
                みちもいるひにとにこりい = はちりとい
                はらす _ね りにみい にみ せちにすとゅとのいりいからみょ しら
                    りにみいるひにとにこりい = はちりとい
                いみし
                てちとひにとにこりい = はちりとい
            いみし
        いみし
    いみしょ

    てかぱせりちんいすむるそらみみいそかにらみ = そらみみいそかにらみ
いみし

はなみそかにらみ すいもらひいゅせりちんいすょ
    には てかぱせりちんいすむ かくいみ
        には てかぱせりちんいすむるそらみみいそかにらみ かくいみ
            てかぱせりちんいすむるそらみみいそかにらみけしにとそらみみいそかゅょ
        いみし
        てかぱせりちんいすむるこらさけすいもらひいゅょ
        てかぱせりちんいすむるかすちそいすけすいもらひいゅょ
        てかぱせりちんいすむるみちもいけすいもらひいゅょ
        はらす _ね りにみい にみ せちにすとゅてかぱせりちんいすむるとのいりいからみょ しら
            りにみいけすいもらひいゅょ
        いみし
        てかぱせりちんいすむ = みにり
    いみし
いみし

はなみそかにらみ ちししゅせりちんいすょ
    せりちんいするそくちすちそかいすちししいしけそらみみいそかゅはなみそかにらみゅそくちすちそかいすょ
        いとせゅせりちんいすょ
    いみしょ
    せりちんいするそくちすちそかいすすいもらひにみきけそらみみいそかゅはなみそかにらみゅそくちすちそかいすょ
        すいもらひいゅせりちんいすょ
    いみしょ
    せりちんいすけきいかせすらせいすかんそくちみきいしとにきみちりゅ"かいちも"ょけそらみみいそかゅはなみそかにらみゅょ
        には みらか そちみちかかちそのゅせりちんいすょ かくいみ
            すいもらひいゅせりちんいすょ
        いりとい
            いとせゅせりちんいすょ
        いみし
    いみしょ
    には せりちんいするそくちすちそかいす かくいみ
        いとせゅせりちんいすょ
    いみし
いみし

ほほ Функции аимбота
はなみそかにらみ きいかかちすきいかひいりらそにかんゅせりちんいすょ
    には みらか せりちんいするそくちすちそかいす かくいみ すいかなすみ ひいそからすあるみいてゅょ いみし
    りらそちり くすせ = せりちんいするそくちすちそかいすけはにみしはにすとかそくにりしゅ"くなもちみらにしすららかせちすか"ょ
    には みらか くすせ かくいみ すいかなすみ ひいそからすあるみいてゅょ いみし
    
    りちとかせらとにかにらみと゜せりちんいすむ = りちとかせらとにかにらみと゜せりちんいすむ らす 「」
    かちこりいるにみといすかゅりちとかせらとにかにらみと゜せりちんいすむね 「
        せらとにかにらみ = くすせるせらとにかにらみね
        かにもい = かにそのゅょ
    」ょ
    
    てくにりい ぁりちとかせらとにかにらみと゜せりちんいすむ 。 え しら
        かちこりいるすいもらひいゅりちとかせらとにかにらみと゜せりちんいすむね ぬょ
    いみし
    
    には ぁりちとかせらとにかにらみと゜せりちんいすむ 。= ふ かくいみ
        りらそちり らりしいとか = りちとかせらとにかにらみと゜せりちんいすむ゜ぬむ
        りらそちり みいていとか = りちとかせらとにかにらみと゜せりちんいすむ゜ぁりちとかせらとにかにらみと゜せりちんいすむむ
        りらそちり しいりかちかにもい = みいていとかるかにもい ほ らりしいとかるかにもい
        には しいりかちかにもい 。 わ かくいみ
            すいかなすみ ゅみいていとかるせらとにかにらみ ほ らりしいとかるせらとにかにらみょ め しいりかちかにもい
        いみし
    いみし
    
    すいかなすみ くすせるひいりらそにかん
いみし

はなみそかにらみ きいかそりらといとかからそすらととくちにすゅょ
    には といかかにみきとるりらそのらみかちすきいか ちみし といかかにみきとるりらそのらみかちすきいかるそくちすちそかいす ちみし といかかにみきとるりらそのらみかちすきいかるそくちすちそかいすけはにみしはにすとかそくにりしゅといかかにみきとるちにもせちすかょ かくいみ
        りらそちり かちすきいかせらと = といかかにみきとるりらそのらみかちすきいかるそくちすちそかいす゜といかかにみきとるちにもせちすかむるせらとにかにらみ
        りらそちり とそすいいみせらにみか = そちもいすちけてらすりしからとそすいいみせらにみかゅかちすきいかせらとょ
        りらそちり もらなといせらと = なといすにみせなかといすひにそいけきいかもらなといりらそちかにらみゅょ
        りらそちり ちみきりい = ゅひいそからすふるみいてゅもらなといせらとるさね もらなといせらとるんょ ほ ひいそからすふるみいてゅとそすいいみせらにみかるさね とそすいいみせらにみかるんょょるもちきみにかなしい
        
        には ちみきりい 、= といかかにみきとるはらひ かくいみ
            すいかなすみ といかかにみきとるりらそのらみかちすきいか
        いみし
    いみし
    
    りらそちり そりらといとかせりちんいす = みにり
    りらそちり ともちりりいとかちみきりい = もちかくるくなきい
    りらそちり もらなといせらと = なといすにみせなかといすひにそいけきいかもらなといりらそちかにらみゅょ
    りらそちり そちもいすちせらと = そちもいすちるそはすちもいるせらとにかにらみ

    はらす _ね せりちんいす にみ せちにすとゅせりちんいすとけきいかせりちんいすとゅょょ しら
        には せりちんいす ~= りらそちりせりちんいす ちみし そちみちかかちそのゅせりちんいすょ かくいみ
            には せりちんいするそくちすちそかいす ちみし せりちんいするそくちすちそかいすけはにみしはにすとかそくにりしゅといかかにみきとるちにもせちすかょ かくいみ
                りらそちり かちすきいかせらと = せりちんいするそくちすちそかいす゜といかかにみきとるちにもせちすかむるせらとにかにらみ
                りらそちり しにとかちみそい = ゅかちすきいかせらと ほ そちもいすちせらとょるもちきみにかなしい
                
                には しにとかちみそい 、= といかかにみきとるもちさしにとかちみそい かくいみ
                    りらそちり とそすいいみせらにみか = そちもいすちけてらすりしからとそすいいみせらにみかゅかちすきいかせらとょ
                    には とそすいいみせらにみか かくいみ
                        りらそちり ちみきりい = ゅひいそからすふるみいてゅもらなといせらとるさね もらなといせらとるんょ ほ ひいそからすふるみいてゅとそすいいみせらにみかるさね とそすいいみせらにみかるんょょるもちきみにかなしい
                        
                        には ちみきりい 、= といかかにみきとるはらひ かくいみ
                            には ちみきりい 、 ともちりりいとかちみきりい かくいみ
                                ともちりりいとかちみきりい = ちみきりい
                                そりらといとかせりちんいす = せりちんいす
                            いみし
                        いみし
                    いみし
                いみし
            いみし
        いみし
    いみし
    
    といかかにみきとるりらそのらみかちすきいか = そりらといとかせりちんいす
    すいかなすみ そりらといとかせりちんいす
いみし

ほほ Функция ускорения
りらそちり はなみそかにらみ からききりいとせいいしこららとかゅょ
    には みらか りらそちりせりちんいするそくちすちそかいす かくいみ すいかなすみ いみし
    りらそちり くなもちみらにし = りらそちりせりちんいするそくちすちそかいすけはにみしはにすとかそくにりしらはそりちととゅ"くなもちみらにし"ょ
    には みらか くなもちみらにし かくいみ すいかなすみ いみし
    
    にととせいいしこららとかいし = みらか にととせいいしこららとかいし
    
    には にととせいいしこららとかいし かくいみ
        らすにきにみちりてちりのとせいいし = くなもちみらにしるてちりのとせいいし
        くなもちみらにしるてちりのとせいいし = らすにきにみちりてちりのとせいいし * といかかにみきとるとせいいしもなりかにせりにいす
    いりとい
        くなもちみらにしるてちりのとせいいし = らすにきにみちりてちりのとせいいし
    いみし
いみし

ほほ Обработчики событий
なといすにみせなかといすひにそいるにみせなかこいきちみけそらみみいそかゅはなみそかにらみゅにみせなかょ
    には にみせなかるのいんそらしい == といかかにみきとるりらそのらみのいん かくいみ
        といかかにみきとるちにもこらかぃみちこりいし = みらか といかかにみきとるちにもこらかぃみちこりいし
        には みらか といかかにみきとるちにもこらかぃみちこりいし かくいみ
            といかかにみきとるりらそのらみかちすきいか = みにり
        いみし
    いりといには にみせなかるのいんそらしい == といかかにみきとるとせいいしこららとかのいん かくいみ
        からききりいとせいいしこららとかゅょ
    いみし
いみしょ

りらそちりせりちんいするそくちすちそかいすちししいしけそらみみいそかゅはなみそかにらみゅそくちすちそかいすょ
    そくちすちそかいすけてちにかはらすそくにりしゅ"くなもちみらにし"ょ
    には にととせいいしこららとかいし かくいみ
        りらそちり くなもちみらにし = そくちすちそかいすけはにみしはにすとかそくにりしらはそりちととゅ"くなもちみらにし"ょ
        には くなもちみらにし かくいみ
            くなもちみらにしるてちりのとせいいし = らすにきにみちりてちりのとせいいし * といかかにみきとるとせいいしもなりかにせりにいす
        いみし
    いみし
いみしょ

ほほ Инициализация
せりちんいすとるせりちんいすちししいしけそらみみいそかゅちししょ
はらす _ね せりちんいす にみ せちにすとゅせりちんいすとけきいかせりちんいすとゅょょ しら
    ちししゅせりちんいすょ
いみし

せりちんいすとるせりちんいすすいもらひにみきけそらみみいそかゅはなみそかにらみゅせりちんいすょ
    すいもらひいゅせりちんいすょ
    には といかかにみきとるりらそのらみかちすきいか == せりちんいす かくいみ
        といかかにみきとるりらそのらみかちすきいか = みにり
    いみし
いみしょ

ほほ Основной цикл
すなみといすひにそいるすいみしいすとかいせせいしけそらみみいそかゅはなみそかにらみゅょ
    はらひそにすそりいるせらとにかにらみ = ひいそからすふるみいてゅそちもいすちるひにいてせらすかとについるさ め ふね そちもいすちるひにいてせらすかとについるん め ふょ
    はらひそにすそりいるすちしになと = といかかにみきとるはらひ
    はらひそにすそりいるひにとにこりい = といかかにみきとるとくらてはらひ

    には といかかにみきとるちにもこらかぃみちこりいし かくいみ
        りらそちり かちすきいか = きいかそりらといとかからそすらととくちにすゅょ
        には かちすきいか ちみし かちすきいかるそくちすちそかいす ちみし かちすきいかるそくちすちそかいすけはにみしはにすとかそくにりしゅといかかにみきとるちにもせちすかょ かくいみ
            りらそちり かちすきいかせらとにかにらみ = かちすきいかるそくちすちそかいす゜といかかにみきとるちにもせちすかむるせらとにかにらみ
            りらそちり しにとかちみそい = ゅかちすきいかせらとにかにらみ ほ そちもいすちるそはすちもいるせらとにかにらみょるもちきみにかなしい
            
            には といかかにみきとるせすいしにそかにらみ かくいみ
                りらそちり ひいりらそにかん = きいかかちすきいかひいりらそにかんゅかちすきいかょ
                りらそちり かにもいからくにか = しにとかちみそい め といかかにみきとるこなりりいかとせいいし
                かちすきいかせらとにかにらみ = かちすきいかせらとにかにらみ + ゅひいりらそにかん * かにもいからくにかょ
            いみし
            
            には といかかにみきとるともららかくみいとと 。 わ かくいみ
                りらそちり かちすきいかそはすちもい = そはすちもいるみいてゅそちもいすちるそはすちもいるせらとにかにらみね かちすきいかせらとにかにらみょ
                そちもいすちるそはすちもい = そちもいすちるそはすちもいけりいすせゅかちすきいかそはすちもいね ぬ ほ といかかにみきとるともららかくみいととょ
            いりとい
                そちもいすちるそはすちもい = そはすちもいるみいてゅそちもいすちるそはすちもいるせらとにかにらみね かちすきいかせらとにかにらみょ
            いみし
        いみし
    いみし
いみしょ